Week4-Challenge/myGoldschmidt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       13260;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       13320;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          360;
        startFace       13380;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          5400;
        startFace       13740;
    }
)

// ************************************************************************* //
